In [ ]:
import numpy as np
import pandas as pd

## Serijos

In [ ]:
pavadinimai = ['x', 'y', 'z']
duomenys = [20, 30, 40]
serija1 = pd.Series(data=duomenys, index=pavadinimai)
serija1

In [ ]:
zodynas = {'a': 5, 'b': 7, 'c': 9, 'd': 11}
serija2 = pd.Series(zodynas)
serija2

In [ ]:
miestai = pd.Series([1,2,3,4,5], ['Vilnius', 'Kaunas', 'Klaipėda', 'Panevezys', 'Šiauliai'])
miestai

In [ ]:
miestai2 = pd.Series([1,2,3,4,5], ['Vilnius', 'Kaunas', 'Lentvaris', 'Šiauliai', 'Klaipėda'])
miestai2

In [ ]:
miestai + miestai2

## DataFrames

In [14]:
df1 = pd.DataFrame(np.random.rand(5,6), 
                   ['a', 'b', 'c', 'd', 'e'],
                   ['U', 'V', 'W', 'X', 'Y', 'Z']
)
df1

          U         V         W         X         Y         Z
a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550
d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018
e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298

In [15]:
df1['U']

a    0.354184
b    0.891391
c    0.784294
d    0.005657
e    0.640683
Name: U, dtype: float64

In [23]:
type(df1['U'])

pandas.core.series.Series

In [24]:
df1.loc['a']

U    0.354184
V    0.242149
W    0.521827
X    0.813850
Y    0.842681
Z    0.462119
Name: a, dtype: float64

In [25]:
type(df1.loc['a'])

pandas.core.series.Series

In [26]:
df1[['U', 'X', 'Z']]

          U         X         Z
a  0.354184  0.813850  0.462119
b  0.891391  0.747718  0.995674
c  0.784294  0.591285  0.081550
d  0.005657  0.846217  0.459018
e  0.640683  0.857582  0.263298

In [28]:
df1['naujas'] = [1, 2, 3, 4, 5]
df1

          U         V         W         X         Y         Z  naujas
a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119       1
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674       2
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550       3
d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018       4
e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298       5

In [31]:
df1.drop('naujas', axis=1, inplace=True)

In [34]:
df1

          U         V         W         X         Y         Z
a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550
d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018
e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298

In [33]:
df1.drop('e')

          U         V         W         X         Y         Z
a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550
d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018

In [35]:
df1.iloc[4]

U    0.640683
V    0.187444
W    0.053144
X    0.857582
Y    0.533479
Z    0.263298
Name: e, dtype: float64

In [36]:
df1.loc['c', 'X']

0.5912847032712037

In [37]:
df1.iloc[2, 3]

0.5912847032712037

In [38]:
df1.loc[['d', 'e'], ['X', 'Y', 'Z']]

          X         Y         Z
d  0.846217  0.258937  0.459018
e  0.857582  0.533479  0.263298

In [47]:
df1.iloc[:,[2, 3]]

          W         X
a  0.521827  0.813850
b  0.855768  0.747718
c  0.859910  0.591285
d  0.540526  0.846217
e  0.053144  0.857582

In [48]:
df1[df1 > 0.4]

          U         V         W         X         Y         Z
a       NaN       NaN  0.521827  0.813850  0.842681  0.462119
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
c  0.784294  0.573606  0.859910  0.591285       NaN       NaN
d       NaN       NaN  0.540526  0.846217       NaN  0.459018
e  0.640683       NaN       NaN  0.857582  0.533479       NaN

In [55]:
df1[df1 > 0.4].fillna(0)

          U         V         W         X         Y         Z
a  0.000000  0.000000  0.521827  0.813850  0.842681  0.462119
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
c  0.784294  0.573606  0.859910  0.591285  0.000000  0.000000
d  0.000000  0.000000  0.540526  0.846217  0.000000  0.459018
e  0.640683  0.000000  0.000000  0.857582  0.533479  0.000000

In [52]:
df1[df1['Y'] > 0.4][['Y', 'Y']]

          Y         Y
a  0.842681  0.842681
b  0.999300  0.999300
e  0.533479  0.533479

In [58]:
df1[(df1['U'] > 0.5) & (df1['Z'] < 0.5)]

          U         V         W         X         Y         Z
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550
e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298

In [61]:
df1[(df1['U'] > 0.5) | (df1['Z'] < 0.3)][['U', 'Z']]

          U         Z
b  0.891391  0.995674
c  0.784294  0.081550
e  0.640683  0.263298

## reindeksavimas

In [70]:
df1.reset_index()

  index         U         V         W         X         Y         Z    Miestai
0     a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119    Vilnius
1     b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674     Kaunas
2     c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550   Klaipeda
3     d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018  Panevezys
4     e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298   Siauliai

In [64]:
nauajas_indeksas = "Vilnius Kaunas Klaipeda Panevezys Siauliai".split()
nauajas_indeksas

['Vilnius', 'Kaunas', 'Klaipeda', 'Panevezys', 'Siauliai']

In [66]:
df1['Miestai'] = nauajas_indeksas
df1

          U         V         W         X         Y         Z    Miestai
a  0.354184  0.242149  0.521827  0.813850  0.842681  0.462119    Vilnius
b  0.891391  0.667592  0.855768  0.747718  0.999300  0.995674     Kaunas
c  0.784294  0.573606  0.859910  0.591285  0.036777  0.081550   Klaipeda
d  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018  Panevezys
e  0.640683  0.187444  0.053144  0.857582  0.533479  0.263298   Siauliai

In [74]:
df1.set_index('Miestai', inplace=True)

In [75]:
df1

                  U         V         W         X         Y         Z
Miestai
Vilnius    0.354184  0.242149  0.521827  0.813850  0.842681  0.462119
Kaunas     0.891391  0.667592  0.855768  0.747718  0.999300  0.995674
Klaipeda   0.784294  0.573606  0.859910  0.591285  0.036777  0.081550
Panevezys  0.005657  0.136350  0.540526  0.846217  0.258937  0.459018
Siauliai   0.640683  0.187444  0.053144  0.857582  0.533479  0.263298